# Parameters
nc: 3  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.125  # layer channel multiple
anchors: 1  # number of anchors
loss: ComputeXLoss

# YOLOv5 backbone
backbone:
  # [from, number, module, args]  args[0]:output
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, DWConvblock, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3_YOLOX, [128, 1, True]],
   [-1, 1, DWConvblock, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3_YOLOX, [256, 3, True]],
   [-1, 1, DWConvblock, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3HB, [512]],
   [-1, 1, DWConvblock, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3HB, [1024]],  # 9
  ]
  
# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3_YOLOX, [512, 1, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3_YOLOX, [256, 1, False]],  # 17 (P3/8-small)

   [-1, 1, DWConvblock, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3_YOLOX, [512, 1, False]],  # 20 (P4/16-medium)

   [-1, 1, DWConvblock, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3_YOLOX, [1024, 1, False]],  # 23 (P5/32-large)

# yolox head
  #baseconv
   [17, 1, Conv, [256, 1, 1]],  # 24 lateral0 (P3/8-small)
   [20, 1, Conv, [256, 1, 1]],  # 25 lateral1 (P4/16-medium)
   [23, 1, Conv, [256, 1, 1]],  # 26 lateral2 (P5/32-large)

  #cbl*2
   [24, 2, DWConvblock, [256, 3, 1]],  # 27 cls0 (P3/8-small)
   [24, 2, DWConvblock, [256, 3, 1]],  # 28 reg0 (P3/8-small)

   [25, 2, DWConvblock, [256, 3, 1]],  # 29 cls1 (P4/16-medium)
   [25, 2, DWConvblock, [256, 3, 1]],  # 30 reg1 (P4/16-medium)

   [26, 2, DWConvblock, [256, 3, 1]],  # 31 cls2 (P5/32-large)
   [26, 2, DWConvblock, [256, 3, 1]],  # 32 reg2 (P5/32-large)

    [[27, 28, 29, 30, 31, 32], 1, DetectX, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
